results/blogPost/benchclient1/quarkus-worker-pool-42000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.537ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.534ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.574ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.526ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.17ms    4.80ms  41.86ms   89.55%
    Req/Sec    11.08k     3.85k   27.44k    81.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.56ms
 75.000%    2.40ms
 90.000%    8.37ms
 99.000%   24.54ms
 99.900%   35.17ms
 99.990%   39.36ms
 99.999%   41.06ms
100.000%   41.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.104     0.000000            1         1.00
       0.698     0.100000       210230         1.11
       0.926     0.200000       419226         1.25
       1.127     0.300000       628421         1.43
       1.331     0.400000       838646         1.67
       1.563     0.500000      1047669         2.00
       1.691     0.550000      1152291         2.22
       1.831     0.600000      1256937         2.50
       1.987     0.650000      1361664         2.86
       2.169     0.700000      1466672         3.33
       2.399     0.750000      1571243         4.00
       2.553     0.775000      1623685         4.44
       2.769     0.800000      1675925         5.00
       3.231     0.825000      1728179         5.71
       4.455     0.850000      1780472         6.67
       6.311     0.875000      1832789         8.00
       7.307     0.887500      1859072         8.89
       8.367     0.900000      1885348        10.00
       9.527     0.912500      1911527        11.43
      10.815     0.925000      1937531        13.33
      12.327     0.937500      1963815        16.00
      13.167     0.943750      1976815        17.78
      14.095     0.950000      1989959        20.00
      15.103     0.956250      2003003        22.86
      16.247     0.962500      2016120        26.67
      17.551     0.968750      2029157        32.00
      18.303     0.971875      2035762        35.56
      19.071     0.975000      2042249        40.00
      19.919     0.978125      2048802        45.71
      20.847     0.981250      2055340        53.33
      21.951     0.984375      2061932        64.00
      22.543     0.985938      2065177        71.11
      23.231     0.987500      2068458        80.00
      24.015     0.989062      2071716        91.43
      24.927     0.990625      2074998       106.67
      25.967     0.992188      2078269       128.00
      26.591     0.992969      2079896       142.22
      27.279     0.993750      2081539       160.00
      28.063     0.994531      2083173       182.86
      28.927     0.995313      2084822       213.33
      29.871     0.996094      2086436       256.00
      30.415     0.996484      2087251       284.44
      30.975     0.996875      2088087       320.00
      31.583     0.997266      2088895       365.71
      32.191     0.997656      2089708       426.67
      32.927     0.998047      2090534       512.00
      33.311     0.998242      2090947       568.89
      33.727     0.998437      2091354       640.00
      34.175     0.998633      2091763       731.43
      34.687     0.998828      2092164       853.33
      35.231     0.999023      2092576      1024.00
      35.519     0.999121      2092774      1137.78
      35.871     0.999219      2092991      1280.00
      36.223     0.999316      2093196      1462.86
      36.607     0.999414      2093395      1706.67
      36.991     0.999512      2093597      2048.00
      37.151     0.999561      2093694      2275.56
      37.375     0.999609      2093803      2560.00
      37.599     0.999658      2093901      2925.71
      37.855     0.999707      2094007      3413.33
      38.143     0.999756      2094103      4096.00
      38.335     0.999780      2094163      4551.11
      38.495     0.999805      2094207      5120.00
      38.655     0.999829      2094258      5851.43
      38.911     0.999854      2094316      6826.67
      39.135     0.999878      2094360      8192.00
      39.231     0.999890      2094384      9102.22
      39.423     0.999902      2094412     10240.00
      39.519     0.999915      2094438     11702.86
      39.647     0.999927      2094460     13653.33
      39.807     0.999939      2094485     16384.00
      39.903     0.999945      2094497     18204.44
      39.935     0.999951      2094510     20480.00
      40.127     0.999957      2094525     23405.71
      40.287     0.999963      2094537     27306.67
      40.415     0.999969      2094549     32768.00
      40.511     0.999973      2094555     36408.89
      40.671     0.999976      2094562     40960.00
      40.735     0.999979      2094569     46811.43
      40.799     0.999982      2094574     54613.33
      40.959     0.999985      2094584     65536.00
      40.959     0.999986      2094584     72817.78
      40.991     0.999988      2094587     81920.00
      41.055     0.999989      2094591     93622.86
      41.087     0.999991      2094593    109226.67
      41.151     0.999992      2094598    131072.00
      41.151     0.999993      2094598    145635.56
      41.183     0.999994      2094600    163840.00
      41.215     0.999995      2094601    187245.71
      41.311     0.999995      2094603    218453.33
      41.439     0.999996      2094605    262144.00
      41.439     0.999997      2094605    291271.11
      41.471     0.999997      2094606    327680.00
      41.535     0.999997      2094607    374491.43
      41.599     0.999998      2094608    436906.67
      41.663     0.999998      2094610    524288.00
      41.663     0.999998      2094610    582542.22
      41.663     0.999998      2094610    655360.00
      41.663     0.999999      2094610    748982.86
      41.663     0.999999      2094610    873813.33
      41.823     0.999999      2094611   1048576.00
      41.823     0.999999      2094611   1165084.44
      41.823     0.999999      2094611   1310720.00
      41.823     0.999999      2094611   1497965.71
      41.823     0.999999      2094611   1747626.67
      41.887     1.000000      2094612   2097152.00
      41.887     1.000000      2094612          inf
#[Mean    =        3.172, StdDeviation   =        4.798]
#[Max     =       41.856, Total count    =      2094612]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2517342 requests in 1.00m, 220.87MB read
Requests/sec:  41956.17
Transfer/sec:      3.68MB