results/blogPost/benchclient1/quarkus-worker-pool-44000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 9.609ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 9.762ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 9.732ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 9.675ms, rate sampling interval: 53ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.33ms   12.46ms 118.91ms   82.97%
    Req/Sec    11.11k     3.56k   21.86k    68.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.83ms
 75.000%   17.07ms
 90.000%   29.38ms
 99.000%   48.10ms
 99.900%   73.66ms
 99.990%   95.87ms
 99.999%  108.03ms
100.000%  118.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.094     0.000000            1         1.00
       0.822     0.100000       219919         1.11
       1.155     0.200000       439320         1.25
       1.505     0.300000       658577         1.43
       1.950     0.400000       878067         1.67
       2.833     0.500000      1097345         2.00
       5.167     0.550000      1207055         2.22
       8.187     0.600000      1316792         2.50
      11.071     0.650000      1426564         2.86
      13.991     0.700000      1536137         3.33
      17.071     0.750000      1646105         4.00
      18.719     0.775000      1700813         4.44
      20.495     0.800000      1755652         5.00
      22.431     0.825000      1810760         5.71
      24.511     0.850000      1865519         6.67
      26.799     0.875000      1920485         8.00
      28.047     0.887500      1947890         8.89
      29.375     0.900000      1975241        10.00
      30.799     0.912500      2002481        11.43
      32.335     0.925000      2030111        13.33
      34.047     0.937500      2057561        16.00
      34.975     0.943750      2071061        17.78
      35.999     0.950000      2085007        20.00
      37.087     0.956250      2098658        22.86
      38.271     0.962500      2112423        26.67
      39.615     0.968750      2125992        32.00
      40.383     0.971875      2132952        35.56
      41.215     0.975000      2139673        40.00
      42.175     0.978125      2146678        45.71
      43.231     0.981250      2153441        53.33
      44.543     0.984375      2160337        64.00
      45.311     0.985938      2163753        71.11
      46.207     0.987500      2167093        80.00
      47.295     0.989062      2170466        91.43
      48.639     0.990625      2173897       106.67
      50.399     0.992188      2177362       128.00
      51.487     0.992969      2179044       142.22
      52.703     0.993750      2180781       160.00
      54.047     0.994531      2182478       182.86
      55.775     0.995313      2184186       213.33
      57.791     0.996094      2185891       256.00
      58.975     0.996484      2186754       284.44
      60.287     0.996875      2187608       320.00
      61.791     0.997266      2188484       365.71
      63.551     0.997656      2189335       426.67
      65.663     0.998047      2190180       512.00
      66.943     0.998242      2190617       568.89
      68.287     0.998437      2191040       640.00
      69.887     0.998633      2191468       731.43
      71.807     0.998828      2191900       853.33
      73.983     0.999023      2192327      1024.00
      75.135     0.999121      2192535      1137.78
      76.543     0.999219      2192752      1280.00
      78.079     0.999316      2192968      1462.86
      79.743     0.999414      2193181      1706.67
      81.599     0.999512      2193398      2048.00
      82.687     0.999561      2193505      2275.56
      83.839     0.999609      2193612      2560.00
      85.055     0.999658      2193713      2925.71
      86.527     0.999707      2193822      3413.33
      88.127     0.999756      2193928      4096.00
      89.023     0.999780      2193983      4551.11
      90.175     0.999805      2194037      5120.00
      91.263     0.999829      2194089      5851.43
      92.799     0.999854      2194148      6826.67
      94.143     0.999878      2194197      8192.00
      95.167     0.999890      2194223      9102.22
      96.127     0.999902      2194250     10240.00
      97.087     0.999915      2194276     11702.86
      98.303     0.999927      2194303     13653.33
      99.327     0.999939      2194331     16384.00
     100.223     0.999945      2194343     18204.44
     100.799     0.999951      2194357     20480.00
     101.439     0.999957      2194371     23405.71
     102.399     0.999963      2194383     27306.67
     103.615     0.999969      2194397     32768.00
     104.191     0.999973      2194403     36408.89
     104.575     0.999976      2194410     40960.00
     105.087     0.999979      2194417     46811.43
     105.919     0.999982      2194425     54613.33
     106.239     0.999985      2194430     65536.00
     106.815     0.999986      2194433     72817.78
     107.263     0.999988      2194437     81920.00
     107.839     0.999989      2194440     93622.86
     108.543     0.999991      2194443    109226.67
     109.311     0.999992      2194447    131072.00
     109.375     0.999993      2194449    145635.56
     109.631     0.999994      2194450    163840.00
     110.271     0.999995      2194453    187245.71
     110.271     0.999995      2194453    218453.33
     111.359     0.999996      2194455    262144.00
     112.127     0.999997      2194456    291271.11
     112.383     0.999997      2194457    327680.00
     113.471     0.999997      2194458    374491.43
     113.471     0.999998      2194458    436906.67
     114.367     0.999998      2194459    524288.00
     115.775     0.999998      2194460    582542.22
     115.775     0.999998      2194460    655360.00
     116.095     0.999999      2194461    748982.86
     116.095     0.999999      2194461    873813.33
     116.095     0.999999      2194461   1048576.00
     117.183     0.999999      2194462   1165084.44
     117.183     0.999999      2194462   1310720.00
     117.183     0.999999      2194462   1497965.71
     117.183     0.999999      2194462   1747626.67
     117.183     1.000000      2194462   2097152.00
     118.975     1.000000      2194463   2330168.89
     118.975     1.000000      2194463          inf
#[Mean    =       10.329, StdDeviation   =       12.461]
#[Max     =      118.912, Total count    =      2194463]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2637306 requests in 1.00m, 231.39MB read
Requests/sec:  43955.68
Transfer/sec:      3.86MB